
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/16334381860)


<pre><code>Plan: 2 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.destination_db.aws_rds_cluster_instance.this[0]
  * module.dms.aws_dms_replication_instance.this
* Update
  * module.bastion.aws_security_group.this
  * module.destination_db.aws_security_group.this
  * module.source_db.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0b37217ff2730f86a"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "live-fire-exercise-bastion-sg"
        tags                   = {
            "Name" = "live-fire-exercise-bastion-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.destination_db.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "destination-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "8.0.mysql_aurora.3.05.2"
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "destination-cluster-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + region                                = "ap-northeast-1"
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

  # module.destination_db.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-00485c7c56a24b2cd"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "destination-cluster-sg"
        tags                   = {
            "Name" = "destination-cluster-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.dms.aws_dms_replication_instance.this will be created
  + resource "aws_dms_replication_instance" "this" {
      + allocated_storage                = 8
      + auto_minor_version_upgrade       = false
      + availability_zone                = (known after apply)
      + engine_version                   = (known after apply)
      + id                               = (known after apply)
      + kms_key_arn                      = (known after apply)
      + multi_az                         = false
      + network_type                     = (known after apply)
      + preferred_maintenance_window     = "sun:10:30-sun:14:30"
      + publicly_accessible              = false
      + region                           = "ap-northeast-1"
      + replication_instance_arn         = (known after apply)
      + replication_instance_class       = "dms.t3.micro"
      + replication_instance_id          = "live-fire-exercise"
      + replication_instance_private_ips = (known after apply)
      + replication_instance_public_ips  = (known after apply)
      + replication_subnet_group_id      = "live-fire-exercise-subnet-group"
      + tags_all                         = (known after apply)
      + vpc_security_group_ids           = [
          + "sg-0ec2a083190c7e823",
        ]
    }

  # module.source_db.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0aa568365484e36cb"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "source-cluster-sg"
        tags                   = {
            "Name" = "source-cluster-sg"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/shimizu-atsuyoshi/live-fire-exercise/issues/12/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":12,"Program":"tfcmt","SHA1":"a868d801558d875251b425c77eefd38b042dcc38","Vars":{},"WorkflowName":"aws plan"} -->